2018/python-multi-threaded-usage-scenario.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 多线程使用场景</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 多线程使用场景</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1a22ab">1. 前言</a></li>
<li><a href="#org8c39f9e">2. GIL</a></li>
<li><a href="#orgac79df2">3. 线程切换</a></li>
<li><a href="#orgebc3b25">4. I/O 操作</a></li>
<li><a href="#org0d20ad5">5. 使用场景</a></li>
<li><a href="#org76b6222">6. 结语</a></li>
<li><a href="#org460dc37">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1a22ab" class="outline-2">
<h2 id="orge1a22ab"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
当初在学习 <code>Python</code> 多线程的时候就了解到： 由于 <code>GIL</code> 的原因， <code>Python</code> 解释器只允许同一时间执行一个线程。
</p>

<p>
随着相关基础知识的学习，渐渐明白了这意味着什么，自然而然的，也就思考起了 <code>Python</code> 多线程的应用场景。
</p>
</div>
</div>

<div id="outline-container-org8c39f9e" class="outline-2">
<h2 id="org8c39f9e"><span class="section-number-2">2</span> GIL</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
全局解释器锁（英语：Global Interpreter Lock，缩写GIL），是计算机程序设计语言解释器用于同步线程的一种机制，它使得任何时刻仅有一个线程在执行。
</p>
</blockquote>

<p>
使用多线程的一个目的就是希望通过多个线程的 <b>并发</b> 执行提高程序的执行效率，但是因为 <code>GIL</code> 的原因，使得多线程的 <b>并发性</b> <del>荡然无存</del>.
</p>

<p>
全局只允许同一时间执行一个线程意味着： 如果是多线程程序，为了保证各个线程都能完成自身的任务，势必需要进行频繁的 <b>线程切换</b> 操作。
</p>
</div>
</div>

<div id="outline-container-orgac79df2" class="outline-2">
<h2 id="orgac79df2"><span class="section-number-2">3</span> 线程切换</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>线程切换</b> 会带来不小的开销，频繁的线程切换会造成资源的浪费。但是在其他环境中，线程可以 <b>并发</b> 的执行，并发带来的效率的提高完全可以忽视因为线程切换带来的消耗。
</p>

<p>
但是在 <code>Python</code> 中，因为 <code>GIL</code> 的存在，多线程带来的 <b>并发性</b> 不在存在，但线程切换的消耗却没有一点减少。
</p>

<p>
这似乎意味着，多线程不仅没有带来性能的提升，而且还因为线程切换的原因，使得程序的性能降低了。
</p>

<p>
多线程编程往往还会提高编码难度，这样一来， <code>Python</code> 中的多线程似乎就失去了存在的价值。
</p>

<p>
但是，存在即是道理，虽然 <code>Python</code> 多线程存在各种各样的问题，但还是要考虑一种情况引起的线程切换。
</p>
</div>
</div>

<div id="outline-container-orgebc3b25" class="outline-2">
<h2 id="orgebc3b25"><span class="section-number-2">4</span> I/O 操作</h2>
<div class="outline-text-2" id="text-4">
<p>
曾经，我以为 <code>I/O</code> 操作也是由 <code>CPU</code> 完成的，程序执行 <code>I/O</code> 操作的时候就是 <code>CPU</code> 不断执行神奇的指令从磁盘读写数据。
</p>

<p>
然后，在学习操作系统的过程中，才发现， <code>I/O</code> 操作是由 <b>磁盘</b> 完成的。
</p>

<p>
需要执行 <code>I/O</code> 操作的时候， <code>CPU</code> 向 <b>磁盘</b> 发起通知，然后就可以去执行其他东西了。
</p>

<p>
当 <b>磁盘</b> 完成相应的 <code>I/O</code> 操作后，向 <code>CPU</code> 发起通知， <code>CPU</code> 在回来继续执行后续的指令。
</p>

<p>
这也就意味着，当某一个线程等待 <code>I/O</code> 操作完成的时候，可以切换到其他线程完成其他工作。
</p>
</div>
</div>

<div id="outline-container-org0d20ad5" class="outline-2">
<h2 id="org0d20ad5"><span class="section-number-2">5</span> 使用场景</h2>
<div class="outline-text-2" id="text-5">
<p>
到了这里， <code>Python</code> 多线程的使用场景就很明了了。
</p>

<p>
常规情况下，线程切换是在执行一定数量的指令（3.2 以前）或执行一定时间后（3.2 以后）进行。
</p>

<p>
这对于 <b>CPU 密集型</b> 的程序来说是不利的，因为 <b>CPU 密集型</b> 的程序主要的消耗集中在执行 <code>CPU</code> 指令上，而 <code>Python</code> 中的多线程因为 <code>GIL</code> 的原因会带来 <b>线程切换</b> 的巨大开销，降低程序性能。
</p>

<p>
对于 <b>I/O 密集型</b> 的程序，由于 <b>I/O</b> 操作可以交付给 <b>磁盘</b> 完成，此时 <code>GIL</code> 带来的负面影响降到了最低。
</p>

<p>
因此， <code>Python</code> 多线程适合的使用场景为： <b>I/O 密集型</b> 的应用程序。
</p>

<p>
对于 <b>CPU 密集型</b> 的程序， <b>多进程</b> 会带来比 <b>多线程</b> 更好的性能。
</p>
</div>
</div>

<div id="outline-container-org76b6222" class="outline-2">
<h2 id="org76b6222"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>Python</code> 的多线程适合用在什么地方，晚上早就有很多的讨论了，结论也早已存在。
</p>

<p>
但是，得出这一结论的思考过程，却是印证所学基础知识的好机会。
</p>

<p>
多线程和单线程在执行 <b>CPU 密集型</b> 和 <b>I/O 密集型</b> 的比较可以看一看这篇文章：
</p>

<ul class="org-ul">
<li><a href="https://juejin.im/entry/5aa6360c518825555e5d7dea">基于 Python 的多进程和多线程对比和应用分析</a></li>
</ul>
</div>
</div>

<div id="outline-container-org460dc37" class="outline-2">
<h2 id="org460dc37"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://zh.wikipedia.org/wiki/%E5%85%A8%E5%B1%80%E8%A7%A3%E9%87%8A%E5%99%A8%E9%94%81">全局解释器锁</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
